app/views/courier/list.html.erb

<ul id = "couriers">
<% Courier.all.each do |c| %>
---
SELECT "couriers".* FROM "couriers"