app/views/courier/show_couriers.html.erb

<ul>
   <% @courier.packages.each do |c| %>
---
SELECT "packages".* FROM "packages" WHERE "packages"."courier_id" = ?  [["courier_id", 10]]