app/controllers/courier_controller.rb

SELECT "couriers".* FROM "couriers"
---
    def list
        @couriers = Courier.all

SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def show
        @courier = Courier.find(params[:id])

SELECT  "packages".* FROM "packages" WHERE "packages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show_package
      @package = Package.find(params[:id])

SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "couriers".* FROM "couriers"
---
    def new_package
      @courier = Courier.find(params[:id])
      @package = Package.new
@couriers = Courier.all

INSERT INTO "packages" ("courier_id", "tracking_number", "delivery_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["courier_id", 6], ["tracking_number", "8"], ["delivery_status", 1], ["created_at", "2021-08-01 10:53:56.289355"], ["updated_at", "2021-08-01 10:53:56.289355"]]
---
  def create_package
      @package = Package.new(package_params)

      if @package.save

INSERT INTO "couriers" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Vera"], ["email", "vera@gmail.com"], ["created_at", "2021-08-01 10:53:27.688334"], ["updated_at", "2021-08-01 10:53:27.688334"]]
---
    def create
        @courier = Courier.new(courier_params)

        if @courier.save

SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def edit
        @courier = Courier.find(params[:id])

SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "couriers" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "couriers"."id" = ?  [["name", "Polina"], ["email", "polina@gmail.com"], ["updated_at", "2021-08-01 11:05:53.042764"], ["id", 10]]
---
    def update
        @courier = Courier.find(params[:id])

        if @courier.update_attributes(courier_param)

DELETE FROM "couriers" WHERE "couriers"."id" = ?  [["id", 6]]
SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def delete
        Courier.find(params[:id]).destroy

SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show_courier
        @courier = Courier.find(params[:id])

SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
     def show_couriers
      @courier = Courier.find(params[:id])